IDEA StatiCa Open Model
LoadingULS Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Loading ULS
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.Load.LoadingULS
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class LoadingULS
Public Class LoadingULS
public ref class LoadingULS
The LoadingULS type exposes the following members.
Constructors
Name | Description
LoadingULS
 Constructor
Top
Properties
Name | Description
InternalForces
 Internal force in section (permanent for staged section)
InternalForces2ndOrder
 Internal forces of 2nd order effect
InternalForcesBegin
 Internal forces at the beginnig
InternalForcesEnd
 Internal forces at the end
InternalForcesImperfection
 Internal forces of imperfection effect
InternalForcesVariable
 Variable internal force in staged section only
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.Load Namespace